const express = require("express")
var router = express.Router()

router.get("/newslist",(req,res)=>{
    var arr = [
        {id:1,title:'消息通知的标题',subtitle:'消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容',route:'/news/newinfo'},
        {id:2,title:'消息通知的标题',subtitle:'消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容',route:'/news/newinfo'},
        {id:3,title:'消息通知的标题',subtitle:'消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容',route:'/news/newinfo'},
        {id:4,title:'消息通知的标题',subtitle:'消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容',route:'/news/newinfo'},
        {id:5,title:'消息通知的标题',subtitle:'消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容',route:'/news/newinfo'},
        {id:6,title:'消息通知的标题',subtitle:'消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容',route:'/news/newinfo'},
        {id:7,title:'消息通知的标题',subtitle:'消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容',route:'/news/newinfo'},
        {id:8,title:'消息通知的标题',subtitle:'消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容',route:'/news/newinfo'},
        {id:9,title:'消息通知的标题',subtitle:'消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容',route:'/news/newinfo'},
        {id:10,title:'消息通知的标题',subtitle:'消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容',route:'/news/newinfo'},
        {id:11,title:'消息通知的标题',subtitle:'消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容',route:'/news/newinfo'},
        {id:12,title:'消息通知的标题',subtitle:'消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容消息通知的内容',route:'/news/newinfo'}
    ]
    res.send(arr)
})

router.get("/prolist",(req,res)=>{
    var arr = [
        {id:1,img:"http://127.0.0.1:3002/img/pic1.png",proTitle:'小米笔记本MIX8核i72G独显',proPrice:18.00,newPrice:15.00},
        {id:2,img:"http://127.0.0.1:3002/img/pic2.png",proTitle:'小米笔记本MIX8核i72G独显',proPrice:18.00,newPrice:15.00},
        {id:3,img:"http://127.0.0.1:3002/img/pic3.png",proTitle:'小米笔记本MIX8核i72G独显',proPrice:18.00,newPrice:15.00},
        {id:4,img:"http://127.0.0.1:3002/img/pic4.png",proTitle:'小米笔记本MIX8核i72G独显',proPrice:18.00,newPrice:15.00}
    ]
    res.send(arr)
})

module.exports = router;